{
	"jot-it": {
		"name": "Jot-it App",
		"summary": "Jot it is a note-taking web app that I developed with inspiration from popular note-centric web services like Evernote and Simplenote. I use Evernote every day and it is one of the most useful, staple tools in my process. So I wanted to use Ruby on Rails to build similar note functionality but with more specific and customized front-end UI decisions.",
		"technical": "Jot It App was developed using Rails 5.0 with HAML for templating, SimpleForm, PostgresQL and Devise for authentication. I also designed the UI of the app in Photoshop as well as its logo, branding and all taglines. I built this application using Rails to gain understanding of the framework.",
		"links": {
      "live": "https://jot-it-app.herokuapp.com",
		  "gh": "https://github.com/ediesyoum/jot-it"
    },
    "tags": [
      "Ruby on Rails",
      "PostgresQL",
      "Devise",
      "HAML",
      "CSS",
      "Graphic Design",
      "UI Design",
      "Responsive Design"
    ]
	},
  "csm": {
    "name": "CSM",
    "summary": "The Colonial Society of Massachusetts (CSM) current website is a Drupal project that I assisted with in the winter of 2016. I helped the development team in coding the designer’s mockup of the front end UI. The site was created to host publications from the Colonial Society for the public to access. These are lengthy historical documents that cannot be found anywhere else on the Internet.",
    "technical": "The CSM site was developed with Drupal 8 using Twig, Bootstrap and Gulp and hosted on Pantheon. The challenge with this project was executing a custom theme to fruition with Drupal 8 using Twig and its built in debugging tool, and making lots of overrides to Bootstrap. There were also a number of interesting places were the team used jQuery to override the default Drupal 8 page infrastructure to make the page’s navigation and search bar more responsive.",
		"links": {
      "live": "https://www.colonialsociety.org/"
    },
    "tags": [
      "Drupal",
      "Pantheon",
      "SCSS",
      "BEM",
      "Bootstrap",
      "jQuery",
      "Twig",
      "Gulp",
      "Responsive Design"
    ]
  },
  "portfolio-current": {
    "name": "Edencod.es",
    "summary": "My current site is a portfolio implementation that I created during the summer of 2017 to utilize the power of React as a framework and creating React components. The goal with this redesign was to showcase all of my previous client work and personal projects, and to continue building on object oriented principles with JavaScript’s class-based ES6 syntax.",
    "technical": "This site was initially configured using Facebook’s Create React App boilerplate, just to try it out. I wanted to find a creative way to enter the wonderful world of React simply because I see reusable components as the future of web development. One of the biggest challenges I faced with this application was learning and how to interact with React’s virtual DOM, and learning how to effectively use HTML inside my JavaScript.\nThe app uses Webpack for module bundling and React Router, tools that both had somewhat steep learning curves but were extremely worthwhile to learn. I am a huge fan of progressive, responsive web apps that look fantastic across all devices and that is what I aimed to create here. I am using a mixture of custom components made by me as well as a few third party components that were executed exceptionally well. Furthermore, the UI was completely designed and mocked up by me using Sketch, Illustrator and Photoshop, and I went through a few design iterations before settling on this one.",
  	"links": {
      "live": "http://www.edencod.es/",
      "gh": "https://github.com/ediesyoum/redesign"
    },
    "tags": [
      "React",
      "Webpack",
      "SASS",
      "ES6",
      "SCSS",
      "SVG",
      "UI Design",
      "UX Design",
      "UX Research",
      "Graphic Design",
      "Responsive Design",
      "Branding"
    ]
  },
  "economy": {
    "name": "Economy",
    "summary": "Economy Restaurant & Bar Supply is a retailer of modern kitchen equipment located in Old City Philadelphia. I played a smaller role with this project as I was only on this assignment for a short time, making wire frames, helping to organize site  infrastructure and working on branding and marketing strategy with the rest of the team.\nIn the beginning of the project, my teammates specifically asked me to represent the user while brainstorming initial ideas because I had a experience supporting end users. So I applied my experience with them into the placement of specific items throughout the UI, and especially into the site infrastructure and making sure it would be clear to users, as well as spending some time on the hierarchy of the way that things like breadcrumbs would be displayed.",
    "technical": "This client is a well-established merchant that has thousands of products. Initially, most of their products were nowhere to be found online. They needed help to establish a web presence that would bring them more sales than the site they had prior, with the implementation of a detailed, stocked eCommerce website. As a team we decided to use Shopify for this endeavor, and decided on using Shopify’s Liquid templating language for custom theming.",
		"links": {
      "live": "https://economydelivers.com/"
    },
    "tags": [
      "Site-Mapping",
      "UX Design",
      "UX Research",
      "Shopify",
      "Branding"
    ]
  },
  "east-end": {
    "name": "East End Salon",
    "summary": "East End Salon was the first project I worked on as part of a small team at a branding agency in late 2014. The salon was looking for a revamp of their website and a new overall look and brand. My team did an excellent job providing them with an updated look and bringing them new clients.",
    "technical": "I worked on this team as a web design intern under a talented lead developer and creative director. I participated in all parts of the project’s lifecycle, from client discovery and UX research, to wireframing and then protoyping and building the site to production. In the beginning, I was responsible for ironing out the site map and infrastructure, sketching initial wireframe ideas and prototyping the parallax site with just HTML and CSS, using divs layered on top of a fixed background. Then as a team we implemented a custom grid framework for responsiveness in addition to adding fun JS animations to the site.",
		"links": {
      "live": "http://eastendsalon.com/"
    },
    "tags": [
      "User Experience",
      "UX Research",
      "UI Development",
      "Branding",
      "Prototyping",
      "Responsive Design",
      "CSS",
      "Client Discovery",
      "Wireframing"
    ]
  },
	"tic-tac-toe": {
		"name": "Tic Tac Toe",
		"summary": "Tic Tac Toe is a two player game where the goal is for each player to mark their turn as X or an O on a game board. The first user to mark three tiles in a row either diagonally, horizontally, or vertically will be the winner. If neither player is able to score three in a row, the game is declared a tie. After a win has been declared, the user can reset their game and continue playing as many times as they wish. The game can be reset at any time throughout game play.",
		"technical": "My motivation for this project was to create and work with game logic and display basic front-end capabilities in the browser, especially with DOM manipulation. It was my second iteration of Tic Tac Toe as a browser based game, using jQuery for interactions instead of vanilla JS (ES5). I created it as an update to my first version, created sometime last year. The winning game logic was written in vanilla JavaScript as it uses the IndexOf method in detecting three winning tiles in a player's array.",
		"links": {
  		"live": "http://tic-tac-toe.edencod.es/",
  		"gh": "https://github.com/ediesyoum/tic-tac-toe-new"
    },
		"tags": [
			"User Experience",
			"User Interface Design",
			"Interaction Design",
			"Vanilla JavaScript",
			"jQuery",
			"CSS"
		]
	},
  "portfolio-old": {
    "name": "Edensyoum.com",
    "summary": "This was a very simple portfolio design that I created in the summer of 2016. I wanted to feature select projects and to make the site look great and scroll nicely on mobile, so I implemented the design using the jQuery plugin Fullpage.js as a responsive mobile-first framework. \nI wanted to fully exercise my creativity with the color palette, font choices and user interactions, and most importantly, I wanted to force a logical single page flow with smooth mobile scrolling and the enabled use of arrow keys to navigate the site.",
		"links": {
      "live": "http://www.edensyoum.com/",
      "gh": "https://github.com/ediesyoum/ediesyoum.github.io"
    },
    "tags": [
      "UI Design",
      "UI Development",
      "jQuery",
      "Responsive Design",
      "Graphic Design",
      "CSS",
      "SPA",
      "User Experience Design"
    ]
  },
  "upenn": {
    "name": "UPenn Labs",
    "summary": "In the Fall of 2014 I was commissioned to work on five UPenn laboratory sites in the School of Arts and Sciences (SAS) while I also provided user support to the labs themselves, to their grad student and post-doc assistants and their Principal Investigators (PIs), or lead Professors.\nDuring my time there I got to know each of these labs very well – to the point of making friends in each lab and sitting with them to look at cool things they were working on, like examining female Drosophila eggs through their microscopes. I spent my days designing and coding the look and feel of their lab websites, and I would also walk around and set up things like FTP for them, or onboard new users and create their user and computer accounts on the server, or troubleshoot lab computers. I considered myself lucky to have the opportunity to walk down the halls and discover more about what these extremely intelligent people were doing for the greater good through their research.\nThis became one of the most rewarding projects that I completed during my time doing IT at UPenn - I deeply enjoyed consulting and learning more about each lab and their contributions to society, while using empathy to brainstorm ways to elegantly display their research data and make it more easily accessible for researchers at other universities and for the greater good via the Internet.",
    "tags": [
      "User Support",
      "User Research",
      "User Experience",
      "User Interface Design",
      "Graphic Design",
      "OpenScholar",
      "Drupal"
    ]
  }
}
